package com.zy.report;

import java.io.FileOutputStream;
import java.io.IOException;
import java.io.OutputStream;
import java.util.HashMap;

import org.apache.http.client.ClientProtocolException;

import com.zy.report.util.EchartsUtil;
import com.zy.report.util.FreemarkerUtil;

import freemarker.template.TemplateException;
import sun.misc.BASE64Decoder;

public class App2 {
    public static void main(String[] args) throws ClientProtocolException, IOException, TemplateException {
        // 变量
    	String string = "[[-2.6,17],[-4.3,16.9],[-5.2,16.8],[-6.1,16.7],[-6.1,16.6],[-7.1,16.5],[-8,16.4],[-8.9,16.3],[-9.6,16.2],[-10.4,16.1],[-11.1,16],[-11.6,15.9],[-11.8,15.8],[-11.8,15.7],[-11.6,15.6],[-11.1,15.5],[-10.4,15.4],[-9.5,15.3],[-8.5,15.2],[-7.3,15.1],[-5.9,15],[-4.5,14.9],[-3,14.8],[-1.5,14.7],[-0.1,14.6],[1.3,14.5],[2.7,14.4],[4,14.3],[5.1,14.2],[6.1,14.1],[6.9,14],[7.6,13.9],[8,13.8],[8.3,13.7],[8.5,13.6],[8.5,13.5],[8.4,13.4],[8.2,13.3],[7.9,13.2],[7.5,13.1],[7.1,13],[6.7,12.9],[6.2,12.8],[5.8,12.7],[5.4,12.6],[5.1,12.5],[4.8,12.4],[4.5,12.3],[4.4,12.2],[4.3,12.1],[4.3,12],[4.4,11.9],[4.5,11.8],[4.7,11.7],[4.9,11.6],[5,11.5],[5.2,11.4],[5.3,11.3],[5.4,11.2],[5.4,11.1],[5.3,11],[5.1,10.9],[4.9,10.8],[4.7,10.7],[4.4,10.6],[4.1,10.5],[3.7,10.4],[3.4,10.3],[3,10.2],[2.7,10.1],[2.5,10],[2.3,9.9],[2.1,9.8],[2,9.7],[1.9,9.6],[1.8,9.5],[1.8,9.4],[1.8,9.3],[1.7,9.2],[1.6,9.1],[1.4,9],[1.2,8.9],[0.9,8.8],[0.5,8.7],[0.1,8.6],[-0.2,8.5],[-0.7,8.4],[-1.1,8.3],[-1.5,8.2],[-1.9,8.1],[-2.2,8],[-2.5,7.9],[-2.7,7.8],[-2.8,7.7],[-2.9,7.6],[-2.9,7.5],[-2.9,7.4],[-2.8,7.3],[-2.6,7.2],[-2.5,7.1],[-2.3,7],[-2.2,6.9],[-2.1,6.8],[-2,6.7],[-2,6.6],[-2,6.5],[-2.1,6.4],[-2.2,6.3],[-2.3,6.2],[-2.4,6.1],[-2.5,6],[-2.5,5.9],[-2.5,5.8],[-2.4,5.7],[-2.2,5.6],[-1.9,5.5],[-1.5,5.4],[-1,5.3],[-0.4,5.2],[0.1,5.1],[0.7,5],[1.3,4.9],[1.9,4.8],[2.3,4.7],[2.7,4.6],[2.9,4.5],[3,4.4],[2.9,4.3],[2.8,4.2],[2.5,4.1],[2.1,4],[1.7,3.9],[1.3,3.8],[0.8,3.7],[0.4,3.6],[0,3.5],[-0.3,3.4],[-0.6,3.3],[-0.8,3.2],[-1,3.1],[-1.1,3],[-1.2,2.9],[-1.2,2.8],[-1.1,2.7],[-1,2.6],[-0.8,2.5],[-0.5,2.4],[-0.1,2.3],[0.2,2.2],[0.7,2.1],[1.2,2],[1.7,1.9],[2.3,1.8],[2.7,1.7],[3.2,1.6],[3.5,1.5],[3.8,1.4],[3.9,1.3],[4,1.2],[4,1.1],[3.9,1],[3.7,0.9],[3.5,0.8],[3.3,0.7],[3,0.6],[2.7,0.5],[2.4,0.4],[2.1,0.3],[1.8,0.2],[1.5,0.1]]";
    	
        // 模板参数
        HashMap<String, Object> datas = new HashMap<>();
        datas.put("data", string);

        // 生成option字符串
        String option = FreemarkerUtil.generateString("spinalbend123.ftl", "", datas);

        // 根据option参数
        String base64 = EchartsUtil.generateEchartsBase64(option);
        
        System.out.println("BASE64:" + base64);
        generateImage(base64, "/Users/wanglei/脊柱侧弯1.png");
    }

    public static void generateImage(String base64, String path) throws IOException {
        BASE64Decoder decoder = new BASE64Decoder();
        try (OutputStream out = new FileOutputStream(path)){
            // 解密
            byte[] b = decoder.decodeBuffer(base64);
            for (int i = 0; i < b.length; ++i) {
                if (b[i] < 0) {
                    b[i] += 256;
                }
            }
            out.write(b);
            out.flush();
        } 
    }
}